#!/bin/bash

# Создание тестовых директорий
TEST_LOG_DIR="/tmp/test_log"
rm -rf "$TEST_LOG_DIR"
mkdir -p "$TEST_LOG_DIR"

# Функция для создания тяжелого файла с нужным временем
create_heavy_file() {
    local filepath="$1"
    local timediff="$2"
    local size="20M" # Размер файла (например, 100 Мегабайт)

    # Создаем файл заданного размера (работает мгновенно)
    if command -v fallocate &>/dev/null; then
        fallocate -l "$size" "$filepath"
    else
        dd if=/dev/zero of="$filepath" bs=1M count=100 status=none
    fi

    # Меняем дату изменения файла
    touch -d "$timediff" "$filepath"
}

echo "=== ПОДГОТОВКА ТЕСТОВОЙ СРЕДЫ ==="
# Создание 5 ТЯЖЕЛЫХ файлов журналов с разным временем изменения
create_heavy_file "$TEST_LOG_DIR/oldest1_file.log" "4 hours ago"
create_heavy_file "$TEST_LOG_DIR/oldest2_file.log" "3 hours ago"
create_heavy_file "$TEST_LOG_DIR/medium1_file.log" "2 hour ago"
create_heavy_file "$TEST_LOG_DIR/medium2_file.log" "1 hour ago"
create_heavy_file "$TEST_LOG_DIR/newest_file.log" "now"

echo "Созданы тестовые файлы в $TEST_LOG_DIR"
ls -lh "$TEST_LOG_DIR"
echo "----------------------------------------"

echo "=== ТЕСТ-КЕЙС 1: Порог N не превышен ==="
# Установка высокого порога 99%, чтобы архивация не сработала
./OneLabWork.sh "$TEST_LOG_DIR" 99 5
echo "Статус выполнения Тест-кейса 1: $?"
echo "----------------------------------------"

echo "=== ТЕСТ-КЕЙС 2: Порог N превышен ==="
# Установка низкого порога 0.1%, чтобы гарантированно запустить архивацию
# Архивация пяти (M=5) самых старых файлов
./OneLabWork.sh "$TEST_LOG_DIR" 0.1 5
STATUS=$?

echo "Статус выполнения Тест-кейса 2: $STATUS"
# echo "Проверка содержимого тестовой папки после архивации:"
# ls -lah "$TEST_LOG_DIR"

echo "Проверка наличия архива в /backup:"
ls -lah /backup 2>/dev/null

echo "=== ТЕСТ-КЕЙС 3: Проверка на негативное число в пороге N ==="
# Установка высокого порога 99%, чтобы архивация не сработала
./OneLabWork.sh "$TEST_LOG_DIR" -1 5
echo "Статус выполнения Тест-кейса 3: $?"
echo "----------------------------------------"

echo "=== ТЕСТ-КЕЙС 4: Проверка на нулевое число в пороге N ==="
# Установка высокого порога 99%, чтобы архивация не сработала
./OneLabWork.sh "$TEST_LOG_DIR" 0 5
echo "Проверка наличия архива в /backup:"
ls -lah /backup 2>/dev/null
echo "Статус выполнения Тест-кейса 4: $?"
echo "----------------------------------------"

echo "=== ТЕСТ-КЕЙС 5: Проверка на ввод букв вместо чисел в пороге N ==="
# Установка высокого порога 99%, чтобы архивация не сработала
./OneLabWork.sh "$TEST_LOG_DIR" a 5
echo "Статус выполнения Тест-кейса 5: $?"
echo "----------------------------------------"

echo "=== ТЕСТ-КЕЙС 6: Проверка на ввод различных символов вместо чисел в пороге N  ==="
# Установка высокого порога 99%, чтобы архивация не сработала
./OneLabWork.sh "$TEST_LOG_DIR" + 5
echo "Статус выполнения Тест-кейса 6: $?"

echo "=== ТЕСТ-КЕЙС 7: Проверка на ввод пробела вместо чисел в пороге N  ==="
./OneLabWork.sh "$TEST_LOG_DIR" " " 5
echo "Статус выполнения Тест-кейса 7: $?"
echo "----------------------------------------"

echo 

echo "=== ТЕСТ-КЕЙС 8: Проверка на негативное число в кол-ве файлов M ==="
# Установка высокого порога 99%, чтобы архивация не сработала
./OneLabWork.sh "$TEST_LOG_DIR" 99 -1
echo "Статус выполнения Тест-кейса 8: $?"
echo "----------------------------------------"

echo "=== ТЕСТ-КЕЙС 9: Проверка на нулевое число в кол-ве файлов M==="
./OneLabWork.sh "$TEST_LOG_DIR" 0.1 0
echo "Статус выполнения Тест-кейса 9: $?"
echo "----------------------------------------"

echo "=== ТЕСТ-КЕЙС 10: Проверка на ввод букв вместо чисел в кол-ве файлов M ==="
./OneLabWork.sh "$TEST_LOG_DIR" 99 a
echo "Статус выполнения Тест-кейса 10: $?"
echo "----------------------------------------"

echo "=== ТЕСТ-КЕЙС 11: Проверка на ввод различных символов вместо чисел в кол-ве файлов M  ==="
./OneLabWork.sh "$TEST_LOG_DIR" 99 +
echo "Статус выполнения Тест-кейса 11: $?"
echo "----------------------------------------"

echo "=== ТЕСТ-КЕЙС 12: Проверка на ввод пробела вместо чисел в кол-ве файлов M  ==="
./OneLabWork.sh "$TEST_LOG_DIR" 99 " "
echo "Статус выполнения Тест-кейса 12: $?"
echo "----------------------------------------"

# Очистка за собой
#rm -rf "$TEST_LOG_DIR"
